# 1)
# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

new_list = [3, 3.5, -987, "user", True, None, ('1', '2', '3',), {'name': 'Damir', 'surname': 'Kozhagulov'}, ["user_1", "user_2", "user_3"]]
print(type(new_list[0]))
print(type(new_list[1]))
print(type(new_list[2]))
print(type(new_list[3]))
print(type(new_list[4]))
print(type(new_list[5]))
print(type(new_list[6]))
print(type(new_list[7]))
print(type(new_list[8]))

