# 1)
# Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

# 2) нужно разделять по файлу на задачу, имена файлов должны содержать номер задачи, например, task_1.py
# 3) в задании 2 вывод не по заданному формату
# 4) задание 3 можно решить для любых чисел, а не только однозначных
# 5) в задании 4 надо было использовать арифметические операции, а не использовать число как строку
# 6) в задании 5 неверно посчитана рентабельность, это (revenue - spending) / revenue
# 7) в задании 6 days надо было считать с 1, а не с 0, неверный ответ даже для данных из примера
# 8) за недочёты снижаю балл


name = "Damir"
age = 29
married = True
child = int(input('how many children do you have?  '))
children_names = input('what are children/child names?  ')
print(name)
print(str(age) + ' лет')
print(married)
print(child)
print(children_names)

